<?php
namespace Crowd\FoundingBundle\DataFixtures\ORM;

use Doctrine\Common\DataFixtures\AbstractFixture;
use Doctrine\Common\DataFixtures\OrderedFixtureInterface;
use Doctrine\Common\Persistence\ObjectManager;
use Crowd\FoundingBundle\Entity\Project;

class ProjectFixtures extends AbstractFixture implements OrderedFixtureInterface
{
    public function load(ObjectManager $manager)
    {
        $project1 = new Project();
        $project1->setName("Економіка 1");
        $project1->setSummary("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project1->setDescription("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project1->setNeededSum(2000000);
        $project1->setCurrentSum(1000000);
        $project1->setMinDonate(100);
        $project1->setPathVideo("https://youtu.be/PecWIEHbutQ");
        $project1->setPathMainPhoto("images/photo.png");
        $project1->setModerated(true);
        $project1->setCategory($manager->merge($this->getReference('category1')));
        $manager->persist($project1);

        $project2 = new Project();
        $project2->setName("Економіка 2");
        $project2->setSummary("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project2->setDescription("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project2->setNeededSum(1000000);
        $project2->setCurrentSum(60000);
        $project2->setMinDonate(50);
        $project2->setPathMainPhoto("images/photo.png");
        $project2->setModerated(true);
        $project2->setCategory($manager->merge($this->getReference('category1')));
        $manager->persist($project2);

        $project3 = new Project();
        $project3->setName("Економіка 3");
        $project3->setSummary("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project3->setDescription("Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами. Твій вклад в розвиток сильного і відкритого суспільства, де ти можеш зібрати гроші на проект. Знайди стартовий капітал для соціального бізнесу, гроші на розробку винаходу, зйомку фільма та інше. Стань співзасновником добрих справ - підтримай коштами.");
        $project3->setNeededSum(1000000);
        $project3->setCurrentSum(60000);
        $project3->setMinDonate(50);
        $project3->setPathMainPhoto("images/photo.png");
        $project3->setModerated(true);
        $project3->setCategory($manager->merge($this->getReference('category1')));
        $manager->persist($project3);

        $manager->flush();

        $this->addReference('project1', $project1);
        $this->addReference('project2', $project2);
        $this->addReference('project3', $project3);

    }
    public function getOrder()
    {
        return 2;
    }
}